Figure/Figure 5/simulations/featureResolved/Ap25dp2T7/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 50;

boundaryField
{
    freeStream
    {
        type            symmetry;
    }
    bottomWall
    {
        //type            noSlip;
        type            fixedValue;
        value           2000000;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
      frontAndBackPlanes 
    {
        type            empty;
    }
}

// ************************************************************************* //
